package Java0224_1;

public abstract class ex01_Abstract {
	
	abstract void sound();
	/*
	 * Q1. 오버로딩과 오버라이딩의 차이점
	 * Q2. 추상클래스와 인터페이스의 차이점
	 * 
	 *  *추상클래스(Abstract Class)
	 *   - 구체적이지 않은 클래스
	 *   - 추상메소드를 꼭 포함해야 한다.
	 *   - 추상메소드는 재정의(자식클래스에서 반드시 재정의 해야 함)
	 *   - 자식클래스의 규격을 정의 : 메소드를 어떻게 구체화 할 것인지 제공
	 *   
	 *   -일반 메소드
	 *   데이터타입 메소드명(){
	 *   
	 *   }
	 *   
	 *   -추상 메소드
	 *   abstract void 메소드명();
	 *   
	 *   - {구현부} 없이 이름만 선언하는 메소드
	 *   - 맨 앞에 abstract를 붙인다.
	 *   - 접근제한자 뒤, 클래스 앞에도 abstract를 선언해야 오류해결
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * */
}
