package Java0224;

public class ex00_Inheritance {
	
	/*  
	 *  1. 상속(Inheritance)
	 *   : Java에서 상속은 부모클래스의 변수, 메소드를 자식 클래스가 물려받아 사용가능하게 해주는 것
	 * 
	 *  2. extends 
	 *   : class가 class를 상속받을 때 사용
	 *   : interface가 interface를 상속받을 때 사용
	 *   : 부모에서 선언/정의를 모두 하고 자식은 변수, 메소드를 그대로 사용할 수 있다.
	 *   : 다중 상속이 불가능하다. 한 개의 클래스만 상속받을 수 있다.
	 *   
	 *  3. implements(interface 구현)
	 *   : 부모 객체는 선언만 하고 정의(내용)은 자식 객체에서 오버라이딩(재정의)해서 사용해야 한다.
	 *   
	 *   
	 *   오버로딩 vs 오버라이딩 차이점
	 *   -오버로딩(Overloading) : 같은 이름의 메소드를 여러개 가지면서 매개변수의 유형과 개수가 다르도록 하는 기술
	 *   -오버라이딩(Overriding) : 부모클래스가 가지고 있는 메소드, 변수를 자식클래스가 재정의해서 사용하는 기술
	 * */
}
